const masktheme = {
  '보헤미안': 'DT-INT-001',
  '해안가' : 'DT-INT-002',
  '현대' : 'DT-INT-003',
  '농가' : 'DT-INT-004',
  '프랑스 국가' : 'DT-INT-005',
  '글램' : 'DT-INT-006',
  '산업용': 'DT-INT-007',
  '재팬디': 'DT-INT-008',
  '미드센추리 모던': 'DT-INT-009',
  '미니멀': 'DT-INT-010',
  '현대': 'DT-INT-011',
  '러스틱': 'DT-INT-012',
  '스칸디나비아': 'DT-INT-013',
  '전통': 'DT-INT-014',
  '과도기': 'DT-INT-015',
  '아름다운 정원': 'DT-EXT-001',
  '매력적인 극장 정원 조경': 'DT-EXT-002',
  '코티지 가든의 다채로운 식목 팔레트': 'DT-EXT-003',
  '화덕과 좌석이 있는 아늑한 코너': 'DT-EXT-004',
  '자갈 조경을 이용한 정원 조경': 'DT-EXT-005',
  '힙합 캘리포니아 정원 조경': 'DT-EXT-006',
  '무성한 녹색 잔디': 'DT-EXT-007',
  '지중해 정원 조경': 'DT-EXT-008',
  '이끼정원': 'DT-EXT-009',
  '야외 식사 및 좌석 공간': 'DT-EXT-010',
  '수영장, 스파 및 화재 기능을 갖춘 파티 준비 야외 공간': 'DT-EXT-011',
  '리조트 스타일 조경 및 수영장': 'DT-EXT-012',
  '잔디밭과 풀 하우스가 있는 원형 수영장': 'DT-EXT-013'

};

export default masktheme;