const masktheme = [
  { value: 'DT-INT-001', name: '보헤미안', description: '자유롭고 예술적인 분위기를 중시하는 스타일로, 다양한 색상과 패턴, 천연 소재를 사용하여 개성 있는 공간을 만듭니다.' },
  { value: 'DT-INT-002', name: '해안가', description: '밝고 통풍이 잘 되며, 바다의 느낌을 담은 스타일로, 파란색과 하얀색을 많이 사용하고 자연스러운 소재를 활용합니다.' },
  { value: 'DT-INT-003', name: '현대', description: '깔끔하고 세련된 느낌을 주는 스타일로, 간결한 선과 중립적인 색상, 최신 트렌드의 가구와 장식을 사용합니다.' },
  { value: 'DT-INT-004', name: '농가', description: '따뜻하고 전통적인 분위기를 지닌 스타일로, 나무와 같은 자연 소재를 많이 사용하고 아늑한 느낌을 줍니다.' },
  { value: 'DT-INT-005', name: '프랑스국가', description: '우아하고 고급스러운 분위기를 지닌 스타일로, 클래식한 가구와 세련된 장식을 사용하여 엘레강트한 공간을 만듭니다.' },
  { value: 'DT-INT-006', name: '글램', description: '화려하고 눈에 띄는 스타일로, 반짝이는 금속 소재와 대담한 색상, 고급스러운 텍스처를 사용하여 럭셔리한 느낌을 줍니다.' },
  { value: 'DT-INT-007', name: '산업용', description: '거친 마감과 노출된 재료를 특징으로 하는 스타일로, 벽돌, 금속, 나무를 사용하여 거칠고 남성적인 느낌을 줍니다.' },
  { value: 'DT-INT-008', name: '재팬디', description: '일본식 간소함과 북유럽식 따뜻함을 결합한 스타일로, 미니멀하면서도 따뜻한 분위기를 줍니다.' },
  { value: 'DT-INT-009', name: '미드센추리모던', description: '20세기 중반의 디자인 특징을 담은 스타일로, 독특한 가구 디자인과 밝은 색상을 사용하여 레트로한 분위기를 만듭니다.' },
  { value: 'DT-INT-010', name: '미니멀', description: '최소한의 장식과 기능성을 중시하는 스타일로, 깔끔하고 단순한 디자인을 통해 여유로운 공간을 만듭니다.' },
  { value: 'DT-INT-011', name: '모던', description: '현대적인 감각과 디자인 요소를 포함한 스타일로, 최신 트렌드와 실용성을 중시하여 세련된 공간을 만듭니다.' },
  { value: 'DT-INT-012', name: '러스틱', description: '자연스러움과 소박함을 강조한 스타일로, 천연 소재와 따뜻한 색상을 사용하여 편안한 분위기를 줍니다.' },
  { value: 'DT-INT-013', name: '스칸디나비아', description: '북유럽 특유의 단순하고 기능적인 스타일로, 밝은 색상과 자연 소재를 사용하여 깔끔하고 아늑한 공간을 만듭니다.' },
  { value: 'DT-INT-014', name: '전통', description: '전통적인 요소와 디자인을 중시하는 스타일로, 클래식한 가구와 장식을 사용하여 격조 높은 공간을 만듭니다.' },
  { value: 'DT-INT-015', name: '과도기', description: '전통과 현대를 결합한 스타일로, 두 가지의 조화를 통해 독특하고 세련된 공간을 만듭니다.' }
];


//이미지 번호에 따른 테마 정의
const themeRanges = {
  '보헤미안': [1, 4],
  '해안가': [5, 8],
  '현대': [9, 12],
  '농가': [13, 16],
  '프랑스국가': [17, 20],
  '글램': [21, 24],
  '산업용': [25, 28],
  '재팬디': [29, 32],
  '미드센추리모던': [33, 36],
  '미니멀': [37, 40],
  '모던': [41, 44],
  '러스틱': [45, 48],
  '스칸디나비아': [49, 52],
  '전통': [53, 56],
  '과도기': [57, 60]
};

export { masktheme, themeRanges };
